export const hiraganaSeionRows: string[][] = [
  ["あ","い","う","え","お"],
  ["か","き","く","け","こ"],
  ["さ","し","す","せ","そ"],
  ["た","ち","つ","て","と"],
  ["な","に","ぬ","ね","の"],
  ["は","ひ","ふ","へ","ほ"],
  ["ま","み","む","め","も"],
  ["や","","ゆ","","よ"],
  ["ら","り","る","れ","ろ"],
  ["わ","","","","を"],
  ["ん","","","",""]
];

export const hiraganaDakutenRows: string[][] = [
  ["が","ぎ","ぐ","げ","ご"],
  ["ざ","じ","ず","ぜ","ぞ"],
  ["だ","ぢ","づ","で","ど"],
  ["ば","び","ぶ","べ","ぼ"],
];

export const hiraganaHandakutenRows: string[][] = [["ぱ","ぴ","ぷ","ぺ","ぽ"]];

export const katakanaSeionRows: string[][] = [
  ["ア","イ","ウ","エ","オ"],
  ["カ","キ","ク","ケ","コ"],
  ["サ","シ","ス","セ","ソ"],
  ["タ","チ","ツ","テ","ト"],
  ["ナ","ニ","ヌ","ネ","ノ"],
  ["ハ","ヒ","フ","ヘ","ホ"],
  ["マ","ミ","ム","メ","モ"],
  ["ヤ","","ユ","","ヨ"],
  ["ラ","リ","ル","レ","ロ"],
  ["ワ","","","","ヲ"],
  ["ン","","","",""]
];

export const katakanaDakutenRows: string[][] = [
  ["ガ","ギ","グ","ゲ","ゴ"],
  ["ザ","ジ","ズ","ゼ","ゾ"],
  ["ダ","ヂ","ヅ","デ","ド"],
  ["バ","ビ","ブ","ベ","ボ"],
];

export const katakanaHandakutenRows: string[][] = [["パ","ピ","プ","ペ","ポ"]];

export const hiraganaYouonRows: string[][] = [
  ["きゃ","","きゅ","","きょ"],
  ["しゃ","","しゅ","","しょ"],
  ["ちゃ","","ちゅ","","ちょ"],
  ["にゃ","","にゅ","","にょ"],
  ["ひゃ","","ひゅ","","ひょ"],
  ["みゃ","","みゅ","","みょ"],
  ["りゃ","","りゅ","","りょ"],
  ["ぎゃ","","ぎゅ","","ぎょ"],
  ["じゃ","","じゅ","","じょ"],
  ["ぢゃ","","ぢゅ","","ぢょ"],
  ["びゃ","","びゅ","","びょ"],
  ["ぴゃ","","ぴゅ","","ぴょ"],
];

export const katakanaYouonRows: string[][] = [
  ["キャ","","キュ","","キョ"],
  ["シャ","","シュ","","ショ"],
  ["チャ","","チュ","","チョ"],
  ["ニャ","","ニュ","","ニョ"],
  ["ヒャ","","ヒュ","","ヒョ"],
  ["ミャ","","ミュ","","ミョ"],
  ["リャ","","リュ","","リョ"],
  ["ギャ","","ギュ","","ギョ"],
  ["ジャ","","ジュ","","ジョ"],
  ["ヂャ","","ヂュ","","ヂョ"],
  ["ビャ","","ビュ","","ビョ"],
  ["ピャ","","ピュ","","ピョ"],
];